Can't Copy Area Tags. The target view doesn't have the same Area Scheme as the original view.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId AreaTagBadViewType { get; }
  Visual Basic
Public Shared ReadOnly Property AreaTagBadViewType As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ AreaTagBadViewType {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures RoomFailures Class
  Autodesk.Revit.DB Namespace